<?php
return [
    /********************************************** start general  *********************************************/
    'add_new'=>'إضافة  ',
    'name_ar' => ' الاسم بالعربية',
  'name_en' => ' الاسم بالانجلزية',
  'name' => ' الاسم ',
  'mobile' => 'الجوال',
  'tel' => 'الهاتف',
  'email' => 'البريد الالكترونى',
  'area' => 'المنطقة',
  'city' => 'المدينة',
  'full_address' => ' العنوان بالكامل',
  'home' => ' الرئيسية ',
  'Arabic'=>'بالعربية',
  'English'=>'بالانجليزية',
  'not_be_delete'=>'لا يمكن حذف العنصر لارتباطه بعناصر اخرى',
  'address_data'=>'بيانات العنوان',
  'main_data'=>'البيانات الأساسية ',
  'price_data'=>'بيانات السعر',
  'img_data'=>'الصورة',
  'hello'=>'مرحباَ',
  'profile'=>'الملف الشخصي',
  'change_password_successfully'=>'تم تغير كلمة المرور بنجاح',
  'dashboard'=>'لوحة التحكم',
  'setting'=>'الإعدادات',
  'hi5' => 'هاي فايف',
  'control_panel'=>'لوحة التحكم',
  'hello'=>'مرحبا، ',
  'profile'=>'الملف الشخصي',
  'logout'=>'تسجيل الخروج',



     /********************************************** end general  *********************************************/

     /********************************************** start category_product   *********************************************/
     'category_products' => 'تصنيف المنتجات',
     'category_product' => 'تصنيف المنتج',


    /********************************************** end category_product  *********************************************/

     /********************************************** start Stores   *********************************************/
     'stores' => 'المخازن ',
     'export_excel'=>'تصدير لاكسل',
     'storekeeper'=>' امين المخزن',
     'store' => 'المخزن ',


    /********************************************** end Stores  *********************************************/

    /********************************************** start internal_store_movements   *********************************************/
     'internal_store_movements' => 'حركات المخازن الداخلية ',
     'from' => 'من',
     'to' => 'الى   ',
     'name_store' => ' اسم المخزن',
     'employee' => ' الموظف ',
     'car_number' => ' رقم السيارة ',
     'processors'=>'معالجة',
     'processors_log'=>'سجل المعالجات',
    'old_value'=>'القيمة القديمة',
    'new_value'=>'القيمة الجديدة',
    'filed'=>'الحقل ',


    /********************************************** end internal_store_movements  *********************************************/

    /********************************************** start internal_store_movements   *********************************************/
    'cars' => ' السيارات  ',
    'car' => ' السيارة  ',
    'car_number' => ' رقم السيارة ',
    'car_type' => ' نوع السيارة  ',
    'car_color' => ' لون السيارة  ',
    'car_driver' => ' سائق السيارة   ',
    'car_manufacturing_year' => 'سنة الصنع',


    /********************************************** start internal_store_movements   *********************************************/



    /********************************************** start items  *********************************************/
  'categoties' => 'الاصناف',
  'items'=>'الاصناف',
  'category_name' => '  اسم الصنف  ',
  'category_name_ar' => '  اسم الصنف بالعربي ',
  'category_name_en' => '  اسم الصنف بالانجليزية  ',
  'manufacture_company' => ' الشركة المصتعة ',
  'unit' => ' الوحدة ',
  'size' => 'المقاس',
  'link_img' => 'رابط الصورة',
  'img' => ' الصورة',
  'type_category' => 'نوع الصنف ',
  'minimum' => 'الحد الادنى ',
  'pricing_price' => 'سعر التسعيرة',
  'final_price' => ' السعر النهائي ',
  'wholesale_price'=>'سعر الجملة   ',
  'cost_price'=>'سعر التكلفة ',
  'barcode'=>'باركود',
      /********************************************** end category  *********************************************/



      /********************************************** start customer  *********************************************/

      'customers' => 'الزبائن',
      'price_category'=>'تصنيف السعر',
      'delegate'=>'المندوب',

        /********************************************** end customer  *********************************************/


        /********************************************** start form  *********************************************/

        'are_you_sure' => 'هل تريد حذف هذا العنصر ؟',
  'are_you_sure_add' => "هل تريد اضافة هذا العنصر؟",

  'cancel' => 'إخفاء',
  'hide' => 'إخفاء',
  'delete' => 'إلغاء',
  'delete_fail' => 'فشلت العملية',
  'delete_success' => 'تمت العملية بنجاح',
  'edit' => 'تعديل',
  'show' => 'عرض',
  'edit_data' => 'تعديل البيانات',
  'error' => 'حدث خطأ غير معروف، الرجاء المحاولة فيما بعد',
  'none' => 'لم يتم ايجاد اي بيانات',
  'ok' => 'حسنا',
  'save' => 'حفظ',
  'save_fail' => 'فشلت العملية',
  'save_success' => 'تمت العملية بنجاح',
  'update_fail' => 'فشلت العملية',
  'update_success' => 'تمت العملية بنجاح',
  'language_specific' => 'معلومات خاصة باللغة',
  'status'=>'الحالة',
  "active"=>'مفعل',
  "inactive"=>'غير مفعل',
  "error_all_filed_required"=>'جميع الحقول مطلوبة',
  "add_successful"=>'تمت الاضافة بنجاح  ',
  "error_process"=>'حدث خطأ أثناء عملية     ',
  "delete_successful"=>'تمت الحذف بنجاح  ',
  "update_successful"=>'تمت التعديل بنجاح  ',
  'mobile_must_be_unique'=>'الجوال مسجل سابقا',
  'email_must_be_unique'=>'البريد الالكترونى مسجل سابقا',
  'tel_must_be_unique'=>'الهاتف مسجل سابقا',
  'username_must_be_unique'=>'اسم المستخدم مسجل مسبقا',
  'car_number_must_be_unique'=>'رقم السيارة مسجل مسبقا   ',

  'name_required'=>'الاسم مطلوب',
  'constant_type_required'=>' نوع الثابت مطلوب',
  'full_address_required'=>'     حقل العنوان بالكامل مطلوب',
  'area_required'=>' حقل المنطقة مطلوب',

  'mobile_required'=>'حقل الجوال مطلوب',
  'name_ar_required'=>' حقل الاسم مطلوب',
  'city_id_required'=>' حقل المدينة مطلوب',
  'delegate_id_required'=>' حقل المندوب مطلوب',

  'driver_id_required'=>' حقل السائق مطلوب',
  'car_number_required'=>' حقل رقم السيارة مطلوب',
  'tel_required'=>' حقل الهاتف مطلوب',
  'storekeeper_id_required'=>' حقل امين المخزن مطلوب',
  'item_id_required'=>' يرجى تحديد الصنف   ',
  'to_store_id_required'=>' يرجى تحديد المخزن   ',

  'from_store_id_required'=>' يرجى تحديد المخزن   ',
  'car_id_required'=>' يرجى تحديد السيارة   ',
  'date_required'=>' حقل التاريخ مطلوب     ',
  'id_itemsArray_required'=>' يرجى اختيار الاصناف',

  'fullname_required'=>' يرجى ادخال الاسم بالكامل ',
  'email_required'=>' يرجى ادخال البريد الالكترونى ',
  'password_required'=>' يرجى ادخال كلمة المرور ',
  'status_required'=>'يرجى تحديد الحالة',

  'quantity_required'=>'يرجى ادخال الكمية ',
  'store_id_required'=>'يرجى تحديد المخزن',
  'rate_required'=>'يرجى ادخال المعدل',
  'category_id_required'=>'يرجى تحديد التصنيف ',
  'unable_to_delete'=>'لا يمكن الحذف',




    /********************************************** end form  *********************************************/


     /********************************************** start suppliers  *********************************************/
     'suppliers' => 'الموردين',
     'name_suppliers'=>'اسم المورد',


     /********************************************** end suppliers  *********************************************/


      /********************************************** start users  *********************************************/

      'users' => 'المستخدمون',
      'user' => 'المستخدم',
      'fullname' => 'الاسم بالكامل',
      'username' => 'اسم المستخدم',
      'password' => 'كلمة السر',
      'confirm_password'=>"تأكيد كلمة السر",
      'change_password' => 'تغيير كلمة السر',
      'permissions' => 'الصلاحيات',
      'phone_no' => 'رقم الجوال',
    /********************************************** start users  *********************************************/



     /********************************************** start system_constants  *********************************************/
     'system_constants' => ' ثوابت النظام ',
     'constant' => 'الثابت ',
     'type' => 'النوع ',


    /********************************************** end system_constants  *********************************************/


   /********************************************** start employees  *********************************************/
   'employees' => ' الموظفين ',


    /********************************************** end employees  *********************************************/

     /********************************************** start entry_documents  *********************************************/
   'entry_documents' => ' مستند إدخال ',
   'supplier' => ' المورد  ',
   'date' => ' التاريخ  ',
   'document' => ' البيان  ',
   'item' => 'الصنف',
   'quantity' => ' الكمية  ',
   'price' => ' السعر  ',
   'print_report' => ' طباعة التقرير  ',







   /********************************************** end entry_documents  *********************************************/


    /********************************************** start items_production  *********************************************/
    'items_production' => 'انتاج منتج',

    /********************************************** end items_production  *********************************************/

    /********************************************** start dismantling_product  *********************************************/
    'dismantling_product' => 'تفكيك المنتج',

    /********************************************** end dismantling_product  *********************************************/


     /********************************************** start tax category   *********************************************/
     'tax_category' => ' تصنيف الضريبة',

     /********************************************** end dismantling_product  *********************************************/



     /********************************************** start taxes   *********************************************/
     'taxes' => 'الضرائب ',
     'rate' => 'المعدل ',



     /********************************************** end taxes  *********************************************/





     /********************************************** start store_item   *********************************************/
     'store_item' => 'عناصر المخزن ',
     'min_quantity' => 'الحد الادنى للكمية  ',
     'max_quantity' => 'الحد الاقصى للكمية  ',
     'quantity_data' => 'بيانات الكميات  ',
     'min_quantity_required'=>'يرجى ادخال الحد الادنى',
     'max_quantity_required'=>'يرجى ادخال الحد الاقصى',



     /********************************************** end store_item  *********************************************/



     /********************************************** start store_item   *********************************************/
     'store_bills' => 'فاتورة المخزن  ',
     'statement'=>'البيان',
     'type_bill'=>'نوع الفاتورة',
     'discount'=>'الخصم',
     'must_chosess_last_one_item'=>'يجب على الاقل اختيار عنصر واحد',
     'statement_required'=>'يرجى ادخال البيان ',
     'type_id_required'=>'يرجى تحديد نوع الفاتورة  ',
     'supplier_id_required'=>'يرجى تحديد المورد   ',
     'transaction_type'=>'نوع العملية',





     /********************************************** end store_item  *********************************************/











];
