<?php
return [
    /********************************************** start general  *********************************************/
    'add_new'=>'إضافة  ',
    'name_ar' => ' الاسم بالعربية',
  'name_en' => ' الاسم بالانجلزية',
  'name' => ' الاسم ',
  'mobile' => 'الجوال',
  'tel' => 'الهاتف',
  'email' => 'البريد الالكترونى',
  'area' => 'المنطقة',
  'city' => 'المدينة',
  'full_address' => ' العنوان بالكامل',
  'home' => ' الرئيسية ',
  'Arabic'=>'بالعربية',
  'English'=>'بالانجليزية',
  'not_be_delete'=>'لا يمكن حذف العنصر لارتباطه بعناصر اخرى',



     /********************************************** end general  *********************************************/


    /********************************************** start category  *********************************************/
  'categoties' => 'الاصناف',
  'category_name' => '  اسم الصنف  ',
  'category_name_ar' => '  اسم الصنف بالعربي ',
  'category_name_en' => '  اسم الصنف بالانجليزية  ',
  'manufacture_company' => ' الشركة المصتعة ',
  'unit' => ' الوحدة ',
  'size' => 'المقاس',
  'link_img' => 'رابط الصورة',
  'img' => ' الصورة',
  'type_category' => 'نوع الصنف ',
  'safety_stocks' => 'مخزون الامان',
  'pricing_price' => 'سعر التسعيرة',
  'final_price' => ' السعر النهائي ',
  'wholesale_price'=>'سعر الجملة   ',
  'cost_price'=>'سعر التكلفة ',
  'barcode'=>'باركود',
      /********************************************** end category  *********************************************/



      /********************************************** start customer  *********************************************/

      'customers' => 'الزبائن',
      'price_category'=>'تصنيف السعر',
      'delegate'=>'المندوب',

        /********************************************** end customer  *********************************************/


        /********************************************** start form  *********************************************/

        'are_you_sure' => 'هل تريد حذف هذا العنصر ؟',
  'are_you_sure_add' => "هل تريد اضافة هذا العنصر؟",

  'cancel' => 'إخفاء',
  'hide' => 'إخفاء',
  'delete' => 'إلغاء',
  'delete_fail' => 'فشلت العملية',
  'delete_success' => 'تمت العملية بنجاح',
  'edit' => 'تعديل',
  'show' => 'عرض',
  'edit_data' => 'تعديل البيانات',
  'error' => 'حدث خطأ غير معروف، الرجاء المحاولة فيما بعد',
  'none' => 'لم يتم ايجاد اي بيانات',
  'ok' => 'حسنا',
  'save' => 'حفظ',
  'save_fail' => 'فشلت العملية',
  'save_success' => 'تمت العملية بنجاح',
  'update_fail' => 'فشلت العملية',
  'update_success' => 'تمت العملية بنجاح',
  'language_specific' => 'معلومات خاصة باللغة',
  'status'=>'الحالة',
  "active"=>'مفعل',
  "inactive"=>'غير مفعل',
  "error_all_filed_required"=>'جميع الحقول مطلوبة',
  "add_successful"=>'تمت الاضافة بنجاح  ',
  "error_process"=>'حدث خطأ أثناء عملية     ',
  "delete_successful"=>'تمت الحذف بنجاح  ',
  "update_successful"=>'تمت التعديل بنجاح  ',
  'mobile_must_be_unique'=>'الجوال مسجل سابقا',
  'email_must_be_unique'=>'البريد الالكترونى مسجل سابقا',
  'tel_must_be_unique'=>'الهاتف مسجل سابقا',
  'username_must_be_unique'=>'اسم المستخدم مسجل مسبقا',

    /********************************************** end form  *********************************************/


     /********************************************** start suppliers  *********************************************/
     'suppliers' => 'الموردين',
     'name_suppliers'=>'اسم المورد',


     /********************************************** end suppliers  *********************************************/


      /********************************************** start users  *********************************************/

      'users' => 'المستخدمون',
      'fullname' => 'الاسم بالكامل',
      'username' => 'اسم المستخدم',
      'password' => 'كلمة السر',
      'confirm_password'=>"تأكيد كلمة السر",
      'change_password' => 'تغيير كلمة السر',
      'permissions' => 'الصلاحيات',
      'phone_no' => 'رقم الجوال',
    /********************************************** start users  *********************************************/



     /********************************************** start system_constants  *********************************************/
     'system_constants' => ' ثوابت النظام ',
     'constant' => 'الثابت ',
     'type' => 'النوع ',


    /********************************************** end system_constants  *********************************************/


   /********************************************** start employees  *********************************************/
   'employees' => ' الموظفين ',


    /********************************************** end employees  *********************************************/

     /********************************************** start entry_documents  *********************************************/
   'entry_documents' => ' مستند إدخال ',
   'supplier' => ' المورد  ',
   'date' => ' التاريخ  ',
   'document' => ' البيان  ',
   'item' => ' الصنف  ',
   'quantity' => ' الكمية  ',
   'price' => ' السعر  ',





   /********************************************** end entry_documents  *********************************************/









];
